RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_FLASH.h
/*! @name XSPELOCK - Express Sector Program and Erase Hardware Lock */
/*! @{ */

#define FLASH_XSPELOCK_XSPELOCK_MASK             (0xFFFFFFFFU)
#define FLASH_XSPELOCK_XSPELOCK_SHIFT            (0U)
#define FLASH_XSPELOCK_XSPELOCK_WIDTH            (32U)
#define FLASH_XSPELOCK_XSPELOCK(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_XSPELOCK_XSPELOCK_SHIFT)) & FLASH_XSPELOCK_XSPELOCK_MASK)
/*! @} */

/*! @name XSSPELOCK - Express Super Sector Program and Erase Hardware Lock */
/*! @{ */

#define FLASH_XSSPELOCK_XSSPELOCK_MASK           (0xFFFU)
#define FLASH_XSSPELOCK_XSSPELOCK_SHIFT          (0U)
#define FLASH_XSSPELOCK_XSSPELOCK_WIDTH          (12U)
#define FLASH_XSSPELOCK_XSSPELOCK(x)             (((uint32_t)(((uint32_t)(x)) << FLASH_XSSPELOCK_XSSPELOCK_SHIFT)) & FLASH_XSSPELOCK_XSSPELOCK_MASK)
/*! @} */

/*! @name TMD - Test Mode Disable Password Check */
/*! @{ */

#define FLASH_TMD_PWD_MASK                       (0xFFFFFFFFU)
#define FLASH_TMD_PWD_SHIFT                      (0U)
#define FLASH_TMD_PWD_WIDTH                      (32U)
#define FLASH_TMD_PWD(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_TMD_PWD_SHIFT)) & FLASH_TMD_PWD_MASK)
/*! @} */

/*! @name UT0 - UTest 0 */
/*! @{ */

#define FLASH_UT0_AID_MASK                       (0x1U)
#define FLASH_UT0_AID_SHIFT                      (0U)
#define FLASH_UT0_AID_WIDTH                      (1U)
#define FLASH_UT0_AID(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AID_SHIFT)) & FLASH_UT0_AID_MASK)

#define FLASH_UT0_AIE_MASK                       (0x2U)
#define FLASH_UT0_AIE_SHIFT                      (1U)
#define FLASH_UT0_AIE_WIDTH                      (1U)
#define FLASH_UT0_AIE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AIE_SHIFT)) & FLASH_UT0_AIE_MASK)

#define FLASH_UT0_AIS_MASK                       (0x4U)
#define FLASH_UT0_AIS_SHIFT                      (2U)
#define FLASH_UT0_AIS_WIDTH                      (1U)
#define FLASH_UT0_AIS(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AIS_SHIFT)) & FLASH_UT0_AIS_MASK)

#define FLASH_UT0_MRV_MASK                       (0x10U)
#define FLASH_UT0_MRV_SHIFT                      (4U)
#define FLASH_UT0_MRV_WIDTH                      (1U)
#define FLASH_UT0_MRV(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_MRV_SHIFT)) & FLASH_UT0_MRV_MASK)

#define FLASH_UT0_MRE_MASK                       (0x20U)
#define FLASH_UT0_MRE_SHIFT                      (5U)
#define FLASH_UT0_MRE_WIDTH                      (1U)
#define FLASH_UT0_MRE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_MRE_SHIFT)) & FLASH_UT0_MRE_MASK)

#define FLASH_UT0_AISUS_MASK                     (0x40U)
#define FLASH_UT0_AISUS_SHIFT                    (6U)
#define FLASH_UT0_AISUS_WIDTH                    (1U)
#define FLASH_UT0_AISUS(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AISUS_SHIFT)) & FLASH_UT0_AISUS_MASK)

#define FLASH_UT0_AIBPE_MASK                     (0x100U)
#define FLASH_UT0_AIBPE_SHIFT                    (8U)
#define FLASH_UT0_AIBPE_WIDTH                    (1U)
#define FLASH_UT0_AIBPE(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AIBPE_SHIFT)) & FLASH_UT0_AIBPE_MASK)

#define FLASH_UT0_NAIBP_MASK                     (0x200U)
#define FLASH_UT0_NAIBP_SHIFT                    (9U)
#define FLASH_UT0_NAIBP_WIDTH                    (1U)
#define FLASH_UT0_NAIBP(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_NAIBP_SHIFT)) & FLASH_UT0_NAIBP_MASK)

#define FLASH_UT0_EIE_MASK                       (0x1000U)
#define FLASH_UT0_EIE_SHIFT                      (12U)
#define FLASH_UT0_EIE_WIDTH                      (1U)
#define FLASH_UT0_EIE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_EIE_SHIFT)) & FLASH_UT0_EIE_MASK)

#define FLASH_UT0_EDIE_MASK                      (0x2000U)
#define FLASH_UT0_EDIE_SHIFT                     (13U)
#define FLASH_UT0_EDIE_WIDTH                     (1U)
#define FLASH_UT0_EDIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_EDIE_SHIFT)) & FLASH_UT0_EDIE_MASK)

#define FLASH_UT0_AEIE_MASK                      (0x4000U)
#define FLASH_UT0_AEIE_SHIFT                     (14U)
#define FLASH_UT0_AEIE_WIDTH                     (1U)
#define FLASH_UT0_AEIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AEIE_SHIFT)) & FLASH_UT0_AEIE_MASK)

#define FLASH_UT0_RRIE_MASK                      (0x8000U)
#define FLASH_UT0_RRIE_SHIFT                     (15U)
#define FLASH_UT0_RRIE_WIDTH                     (1U)
#define FLASH_UT0_RRIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_RRIE_SHIFT)) & FLASH_UT0_RRIE_MASK)

#define FLASH_UT0_SBCE_MASK                      (0x40000000U)
#define FLASH_UT0_SBCE_SHIFT                     (30U)
#define FLASH_UT0_SBCE_WIDTH                     (1U)
#define FLASH_UT0_SBCE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_SBCE_SHIFT)) & FLASH_UT0_SBCE_MASK)

#define FLASH_UT0_UTE_MASK                       (0x80000000U)
#define FLASH_UT0_UTE_SHIFT                      (31U)
#define FLASH_UT0_UTE_WIDTH                      (1U)
#define FLASH_UT0_UTE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_UTE_SHIFT)) & FLASH_UT0_UTE_MASK)
/*! @} */

/*! @name UM - UMISRn */
/*! @{ */

#define FLASH_UM_MISR_MASK                       (0xFFFFFFFFU)
#define FLASH_UM_MISR_SHIFT                      (0U)
#define FLASH_UM_MISR_WIDTH                      (32U)
#define FLASH_UM_MISR(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UM_MISR_SHIFT)) & FLASH_UM_MISR_MASK)
/*! @} */

/*! @name UM9 - UMISR9 */
/*! @{ */

#define FLASH_UM9_MISR_MASK                      (0x1U)
#define FLASH_UM9_MISR_SHIFT                     (0U)
#define FLASH_UM9_MISR_WIDTH                     (1U)
#define FLASH_UM9_MISR(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UM9_MISR_SHIFT)) & FLASH_UM9_MISR_MASK)
/*! @} */

/*! @name UD0 - UTest Data 0 */
/*! @{ */

#define FLASH_UD0_EDATA_MASK                     (0xFFFFFFFFU)
#define FLASH_UD0_EDATA_SHIFT                    (0U)
#define FLASH_UD0_EDATA_WIDTH                    (32U)
#define FLASH_UD0_EDATA(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UD0_EDATA_SHIFT)) & FLASH_UD0_EDATA_MASK)
/*! @} */

/*! @name UD1 - UTest Data 1 */
/*! @{ */

#define FLASH_UD1_EDATA_MASK                     (0xFFFFFFFFU)
#define FLASH_UD1_EDATA_SHIFT                    (0U)
#define FLASH_UD1_EDATA_WIDTH                    (32U)
#define FLASH_UD1_EDATA(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UD1_EDATA_SHIFT)) & FLASH_UD1_EDATA_MASK)
/*! @} */

